
Feature: Вход в системата

  Scenario: Вход в системата с валидни потребителски данни
    Given Потребителя отваря страницата за вход в ситстемата.
    When Въвежда потребителско име "Иван"
    And Въвежда парола "Pass12343"
    And Натиска върху бутона за вход в системата.
    Then Вижда съобщение "OK".
    
  Scenario: Вход в системата с невалидни потребителски данни
    Given Потребителя отваря страницата за вход в ситстемата.
    When Въвежда потребителско име "Иван12"
    And Въвежда парола "12Pass1234"
    And Натиска върху бутона за вход в системата.
    Then Вижда съобщение "грешни потребителски данни".
    
  Scenario: Вход в системата без парола
    Given Потребителя отваря страницата за вход в ситстемата.
    When Въвежда потребителско име "Иван12"
    And Натиска върху бутона за вход в системата.
    Then Вижда съобщение "Въведете парола12".
    
  Scenario: Вход в системата без потребителско име
    Given Потребителя отваря страницата за вход в ситстемата.
    When Въвежда парола "12Pass1234"
    And Натиска върху бутона за вход в системата.
    Then Вижда съобщение "Въведете потребителско име".
    
  Scenario: Вход в системата без потребителски данни
    Given Потребителя отваря страницата за вход в ситстемата.
    When Натиска върху бутона за вход в системата.
    Then Вижда съобщение "Въведете потребителско име и парола".
